table_15180 = [
    # Исполнение А
    {"type": "А", "p_min": 0.1, "p_max": 0.25, "dn_min": 10, "dn_max": 3000, "face_type": ['B']},
    {"type": "А", "p_min": 0.25, "p_max": 0.63, "dn_min": 10, "dn_max": 2400, "face_type": ['B']},
    {"type": "А", "p_min": 0.63, "p_max": 1.0, "dn_min": 10, "dn_max": 2000, "face_type": ['B']},
    {"type": "А", "p_min": 1.0, "p_max": 1.6, "dn_min": 10, "dn_max": 1600, "face_type": ['B']},
    {"type": "А", "p_min": 1.6, "p_max": 2.5, "dn_min": 10, "dn_max": 1600, "face_type": ['B']},
    {"type": "А", "p_min": 2.5, "p_max": 4.0, "dn_min": 10, "dn_max": 1200, "face_type": ['B']},
    # Исполнение Б
    {"type": "Б", "p_min": 0.1, "p_max": 4.0, "dn_min": 10, "dn_max": 800, "face_type": ['E', 'F']},
    {"type": "Б", "p_min": 4.0, "p_max": 6.3, "dn_min": 10, "dn_max": 600, "face_type": ['E', 'F']},
    {"type": "Б", "p_min": 6.3, "p_max": 10.0, "dn_min": 10, "dn_max": 400, "face_type": ['E', 'F']},
    {"type": "Б", "p_min": 10.0, "p_max": 16.0, "dn_min": 10, "dn_max": 250, "face_type": ['E', 'F']},
    # Исполнение В
    {"type": "В", "p_min": 0.1, "p_max": 4.0, "dn_min": 10, "dn_max": 800, "face_type": ['C_L', 'D_M']},
    {"type": "В", "p_min": 4.0, "p_max": 6.3, "dn_min": 10, "dn_max": 600, "face_type": ['C_L', 'D_M']},
    {"type": "В", "p_min": 6.3, "p_max": 10.0, "dn_min": 10, "dn_max": 400, "face_type": ['C_L', 'D_M']},
    {"type": "В", "p_min": 10.0, "p_max": 16.0, "dn_min": 10, "dn_max": 250, "face_type": ['C_L', 'D_M']},
    # Исполнение Г
    {"type": "Г", "p_min": 0.1, "p_max": 4.0, "dn_min": 10, "dn_max": 800, "face_type": ['C_L', 'D_M']},
    {"type": "Г", "p_min": 4.0, "p_max": 6.3, "dn_min": 10, "dn_max": 600, "face_type": ['C_L', 'D_M']},
    {"type": "Г", "p_min": 6.3, "p_max": 10.0, "dn_min": 10, "dn_max": 400, "face_type": ['C_L', 'D_M']},
    {"type": "Г", "p_min": 10.0, "p_max": 16.0, "dn_min": 10, "dn_max": 250, "face_type": ['C_L', 'D_M']},
    {"type": "Г", "p_min": 16.0, "p_max": 20.0, "dn_min": 15, "dn_max": 250, "face_type": ['C_L', 'D_M']},
    # Исполнение Д
    {"type": "Д", "p_min": 0.1, "p_max": 0.63, "dn_min": 40, "dn_max": 800, "face_type": ['B', 'D_M']},
    {"type": "Д", "p_min": 0.63, "p_max": 4.0, "dn_min": 25, "dn_max": 800, "face_type": ['B', 'D_M']},
    {"type": "Д", "p_min": 4.0, "p_max": 6.3, "dn_min": 25, "dn_max": 600, "face_type": ['B', 'D_M']},
    {"type": "Д", "p_min": 6.3, "p_max": 10.0, "dn_min": 25, "dn_max": 400, "face_type": ['B', 'D_M']},
    {"type": "Д", "p_min": 10.0, "p_max": 16.0, "dn_min": 25, "dn_max": 250, "face_type": ['B', 'D_M']},
    {"type": "Д", "p_min": 16.0, "p_max": 20.0, "dn_min": 25, "dn_max": 250, "face_type": ['B', 'D_M']},
]

table_34655 = [
    #  Тип 1 овальное сечение (только от 300 до 1200 рассматриваем пока что
    {"type": "1", "p_min": 6.3, "p_max": 25.0, "dn_min": 300, "dn_max": 600, "face_type": ['J']},
    #  Тип 2 восьмиугольное сечение (только от 300 до 1200 рассматриваем пока что
    {"type": "2", "p_min": 6.3, "p_max": 25.0, "dn_min": 300, "dn_max": 600, "face_type": ['J']},
    #  Тип 3 линзовая (только от 300 до 1200 рассматриваем пока что
    {"type": "3", "p_min": 6.3, "p_max": 20.0, "dn_min": 300, "dn_max": 400, "face_type": ['K']},
]

table_iso_7483 = [
    #  Тип 1 овальное сечение (только от 300 до 1200 рассматриваем пока что
    {"type": "1", "p_min": 2.0, "p_max": 15.0, "dn_min": 300, "dn_max": 600, "face_type": ['J']},
    #  Тип 2 восьмиугольное сечение (только от 300 до 1200 рассматриваем пока что
    {"type": "2", "p_min": 2.0, "p_max": 15.0, "dn_min": 300, "dn_max": 900, "face_type": ['J']},
]

table_28759_8 = [
    {"type": "1", "p_min": 6.3, "p_max": 16.0, "dn_min": 400, "dn_max": 1200, "face_type": ['J']}
]

GASKET_SIZES_15180 = {  # Только из паронита толщина Ду>= 1400 - 3 мм
    'А': [  # РУССКИЕ БУКВЫ
        (300, (0.1, 0.63), 372, 318, 2, 'Паронит по ГОСТ 481-80'),
        (300, (0.63, 1.0), 376, 318, 2, 'Паронит по ГОСТ 481-80'),
        (300, (1.0, 1.6), 382, 318, 2, 'Паронит по ГОСТ 481-80'),
        (300, (1.6, 2.5), 398, 318, 2, 'Паронит по ГОСТ 481-80'),
        (300, (2.5, 4.0), 415, 318, 2, 'Паронит по ГОСТ 481-80'),

        (350, (0.1, 0.63), 421, 372, 2, 'Паронит по ГОСТ 481-80'),
        (350, (0.63, 1.0), 436, 372, 2, 'Паронит по ГОСТ 481-80'),
        (350, (1.0, 1.6), 442, 372, 2, 'Паронит по ГОСТ 481-80'),
        (350, (1.6, 2.5), 455, 372, 2, 'Паронит по ГОСТ 481-80'),
        (350, (2.5, 4.0), 475, 372, 2, 'Паронит по ГОСТ 481-80'),

        (400, (0.1, 0.63), 473, 421, 2, 'Паронит по ГОСТ 481-80'),
        (400, (0.63, 1.0), 487, 421, 2, 'Паронит по ГОСТ 481-80'),
        (400, (1.0, 1.6), 495, 421, 2, 'Паронит по ГОСТ 481-80'),
        (400, (1.6, 2.5), 515, 421, 2, 'Паронит по ГОСТ 481-80'),
        (400, (2.5, 4.0), 543, 421, 2, 'Паронит по ГОСТ 481-80'),

        (450, (0.1, 0.63), 528, 473, 2, 'Паронит по ГОСТ 481-80'),
        (450, (0.63, 1.0), 537, 473, 2, 'Паронит по ГОСТ 481-80'),
        (450, (1.0, 1.6), 553, 473, 2, 'Паронит по ГОСТ 481-80'),
        (450, (1.6, 2.5), 565, 473, 2, 'Паронит по ГОСТ 481-80'),
        (450, (2.5, 4.0), 568, 473, 2, 'Паронит по ГОСТ 481-80'),

        (500, (0.1, 0.63), 576, 528, 2, 'Паронит по ГОСТ 481-80'),
        (500, (0.63, 1.0), 592, 528, 2, 'Паронит по ГОСТ 481-80'),
        (500, (1.0, 1.6), 615, 528, 2, 'Паронит по ГОСТ 481-80'),
        (500, (1.6, 4.0), 620, 528, 2, 'Паронит по ГОСТ 481-80'),

        (600, (0.1, 0.63), 677, 620, 2, 'Паронит по ГОСТ 481-80'),
        (600, (0.63, 1.0), 693, 620, 2, 'Паронит по ГОСТ 481-80'),
        (600, (1.0, 2.5), 728, 620, 2, 'Паронит по ГОСТ 481-80'),
        (600, (2.5, 4.0), 739, 620, 2, 'Паронит по ГОСТ 481-80'),

        (700, (0.1, 0.63), 782, 720, 2, 'Паронит по ГОСТ 481-80'),
        (700, (0.63, 1.0), 808, 720, 2, 'Паронит по ГОСТ 481-80'),
        (700, (1.0, 1.6), 798, 720, 2, 'Паронит по ГОСТ 481-80'),
        (700, (1.6, 2.5), 827, 720, 2, 'Паронит по ГОСТ 481-80'),
        (700, (2.5, 4.0), 844, 720, 2, 'Паронит по ГОСТ 481-80'),

        (800, (0.1, 0.63), 888, 820, 2, 'Паронит по ГОСТ 481-80'),
        (800, (0.63, 1.0), 915, 820, 2, 'Паронит по ГОСТ 481-80'),
        (800, (1.0, 1.6), 908, 820, 2, 'Паронит по ГОСТ 481-80'),
        (800, (1.6, 2.5), 942, 820, 2, 'Паронит по ГОСТ 481-80'),
        (800, (2.5, 4.0), 970, 820, 2, 'Паронит по ГОСТ 481-80'),

        (900, (0.1, 0.63), 988, 920, 2, 'Паронит по ГОСТ 481-80'),
        (900, (0.63, 1.0), 1015, 920, 2, 'Паронит по ГОСТ 481-80'),
        (900, (1.0, 1.6), 1008, 920, 2, 'Паронит по ГОСТ 481-80'),
        (900, (1.6, 2.5), 1034, 920, 2, 'Паронит по ГОСТ 481-80'),
        (900, (2.5, 4.0), 1080, 920, 2, 'Паронит по ГОСТ 481-80'),

        (1000, (0.1, 0.63), 1088, 1020, 2, 'Паронит по ГОСТ 481-80'),
        (1000, (0.63, 1.0), 1125, 1020, 2, 'Паронит по ГОСТ 481-80'),
        (1000, (1.0, 1.6), 1122, 1020, 2, 'Паронит по ГОСТ 481-80'),
        (1000, (1.6, 2.5), 1150, 1020, 2, 'Паронит по ГОСТ 481-80'),
        (1000, (2.5, 4.0), 1190, 1020, 2, 'Паронит по ГОСТ 481-80'),

        (1200, (0.1, 0.25), 1288, 1220, 2, 'Паронит по ГОСТ 481-80'),
        (1200, (0.25, 0.63), 1305, 1220, 2, 'Паронит по ГОСТ 481-80'),
        (1200, (0.63, 1.0), 1338, 1220, 2, 'Паронит по ГОСТ 481-80'),
        (1200, (1.0, 1.6), 1334, 1220, 2, 'Паронит по ГОСТ 481-80'),
        (1200, (1.6, 2.5), 1360, 1220, 2, 'Паронит по ГОСТ 481-80'),
        (1200, (2.5, 4.0), 1394, 1220, 2, 'Паронит по ГОСТ 481-80'),
    ],
    'Б': [
        (300, (0.1, 0.63), 356, 318, 2, 'Паронит по ГОСТ 481-80'),
        (300, (0.63, 16.0), 363, 318, 2, 'Паронит по ГОСТ 481-80'),

        (350, (0.1, 0.63), 406, 372, 2, 'Паронит по ГОСТ 481-80'),
        (350, (0.63, 10.0), 421, 372, 2, 'Паронит по ГОСТ 481-80'),

        (400, (0.1, 0.63), 456, 421, 2, 'Паронит по ГОСТ 481-80'),
        (400, (0.63, 10.0), 473, 421, 2, 'Паронит по ГОСТ 481-80'),

        (450, (0.1, 0.63), 509, 473, 2, 'Паронит по ГОСТ 481-80'),
        (450, (0.63, 4.0), 523, 473, 2, 'Паронит по ГОСТ 481-80'),

        (500, (0.1, 0.63), 561, 528, 2, 'Паронит по ГОСТ 481-80'),
        (500, (0.63, 6.3), 575, 528, 2, 'Паронит по ГОСТ 481-80'),

        (600, (0.1, 0.63), 661, 620, 2, 'Паронит по ГОСТ 481-80'),
        (600, (0.63, 6.3), 677, 620, 2, 'Паронит по ГОСТ 481-80'),

        (700, (0.1, 0.63), 763, 720, 2, 'Паронит по ГОСТ 481-80'),
        (700, (0.63, 4.0), 777, 720, 2, 'Паронит по ГОСТ 481-80'),

        (800, (0.1, 0.63), 867, 820, 2, 'Паронит по ГОСТ 481-80'),
        (800, (0.63, 4.0), 877, 820, 2, 'Паронит по ГОСТ 481-80'),
    ],
    'В': [
        (300, (0.1, 0.63), 356, 336, 2, 'Паронит по ГОСТ 481-80'),
        (300, (0.63, 16.0), 363, 343, 2, 'Паронит по ГОСТ 481-80'),

        (350, (0.1, 0.63), 406, 386, 2, 'Паронит по ГОСТ 481-80'),
        (350, (0.63, 10.0), 421, 395, 2, 'Паронит по ГОСТ 481-80'),

        (400, (0.1, 0.63), 456, 436, 2, 'Паронит по ГОСТ 481-80'),
        (400, (0.63, 10.0), 473, 447, 2, 'Паронит по ГОСТ 481-80'),

        (450, (0.1, 0.63), 509, 489, 2, 'Паронит по ГОСТ 481-80'),
        (450, (0.63, 4.0), 523, 497, 2, 'Паронит по ГОСТ 481-80'),

        (500, (0.1, 0.63), 561, 541, 2, 'Паронит по ГОСТ 481-80'),
        (500, (0.63, 6.3), 575, 549, 2, 'Паронит по ГОСТ 481-80'),

        (600, (0.1, 0.63), 661, 635, 2, 'Паронит по ГОСТ 481-80'),
        (600, (0.63, 6.3), 677, 651, 2, 'Паронит по ГОСТ 481-80'),

        (700, (0.1, 0.63), 763, 737, 2, 'Паронит по ГОСТ 481-80'),
        (700, (0.63, 4.0), 777, 751, 2, 'Паронит по ГОСТ 481-80'),

        (800, (0.1, 0.63), 867, 841, 2, 'Паронит по ГОСТ 481-80'),
        (800, (0.63, 4.0), 877, 851, 2, 'Паронит по ГОСТ 481-80'),
    ],
    'Г': [  # Из фторопласта-4 и прокладочной ленты ПН по ГОСТ 24222-80
        (300, (0.1, 0.63), 357, 335, 2, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),
        (300, (0.63, 16.0), 364, 342, 2, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),

        (350, (0.1, 0.63), 407, 385, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),
        (350, (0.63, 10.0), 422, 394, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),

        (400, (0.1, 0.63), 457, 435, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),
        (400, (0.63, 10.0), 474, 446, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),

        (450, (0.1, 0.63), 510, 488, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),
        (450, (0.630, 4.0), 524, 496, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),

        (500, (0.1, 0.63), 562, 540, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),
        (500, (0.63, 6.3), 576, 548, 3, 'Фторопласт-4 или лента ПН по ГОСТ 24222-80'),

        (300, (0.1, 0.63), 357, 335, 2, 'Уплотнительный материал ФУМ-В'),
        (300, (0.63, 16.0), 364, 342, 2, 'Уплотнительный материал ФУМ-В'),

        (350, (0.1, 0.63), 407, 385, 3, 'Уплотнительный материал ФУМ-В'),
        (350, (0.63, 10.0), 422, 394, 3, 'Уплотнительный материал ФУМ-В'),

        (400, (0.1, 0.63), 457, 435, 3, 'Уплотнительный материал ФУМ-В'),
        (400, (0.63, 10.0), 474, 446, 3, 'Уплотнительный материал ФУМ-В'),

        (450, (0.1, 0.63), 510, 488, 3, 'Уплотнительный материал ФУМ-В'),
        (450, (0.63, 4.0), 524, 496, 3, 'Уплотнительный материал ФУМ-В'),

        (500, (0.1, 0.63), 562, 540, 3, 'Уплотнительный материал ФУМ-В'),
        (500, (0.63, 6.3), 576, 548, 3, 'Уплотнительный материал ФУМ-В'),

        (600, (0.1, 0.63), 662, 634, 3, 'Уплотнительный материал ФУМ-В'),
        (600, (0.63, 6.3), 678, 650, 3, 'Уплотнительный материал ФУМ-В'),

        (700, (0.1, 0.63), 764, 736, 4, 'Уплотнительный материал ФУМ-В'),
        (700, (0.63, 4.0), 778, 750, 4, 'Уплотнительный материал ФУМ-В'),

        (800, (0.1, 0.63), 864, 840, 4, 'Уплотнительный материал ФУМ-В'),
        (800, (0.63, 4.0), 878, 850, 4, 'Уплотнительный материал ФУМ-В'),
    ],
    'Д': [
        (300, (0.1, 0.63), 357, 345, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (300, (0.63, 16.0), 364, 352, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (350, (0.1, 0.63), 407, 395, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (350, (0.63, 10.0), 422, 406, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (400, (0.1, 0.63), 457, 445, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (400, (0.63, 10.0), 474, 458, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (450, (0.1, 0.63), 510, 498, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (450, (0.63, 4.0), 524, 508, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (500, (0.1, 0.63), 562, 550, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (500, (0.63, 6.3), 576, 560, 6, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (600, (0.1, 0.63), 662, 644, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (600, (0.63, 6.3), 678, 660, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (700, (0.1, 0.63), 764, 746, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (700, (0.63, 4.0), 778, 760, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),

        (800, (0.1, 0.63), 868, 850, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),
        (800, (0.63, 4.0), 878, 860, 7, 'Листовая резина тип 1 по ГОСТ 7338-77'),
    ]
}

GASKET_SIZES_34655 = {
    '1': [  # Dn, (p_min, p_max), d_ext, d_int, h, R, material
        (300, (6.3, 10.0), 386, 364, 18, 5.5, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (300, (10.0, 16.0), 402, 358, 30, 11.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (300, (16.0, 25.0), 403.23, 358.77, 28.7, 11.12, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (350, (6.3, 6.3), 431, 409, 18, 5.5, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (6.3, 10.0), 436, 404, 22, 8.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (10.0, 16.0), 442, 398, 30, 11.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (16.0, 25.0), 444.5, 393.7, 33.3, 12.7, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (400, (6.3, 6.3), 491, 469, 18, 5.5, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (6.3, 10.0), 496, 464, 22, 8.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (10.0, 16.0), 502, 458, 30, 11.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (16.0, 25.0), 498.48, 441.32, 36.6, 14.29, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (500, (6.3, 10.0), 596.9, 571.5, 19.1, 6.35, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (500, (10.0, 16.0), 603.25, 565.15, 25.4, 9.53, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (500, (16.0, 25.0), 619.95, 552.45, 39.6, 15.88, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (600, (6.3, 10.0), 708.03, 676.27, 22.4, 7.94, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (600, (10.0, 16.0), 717.55, 666.75, 33.3, 12.7, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (600, (16.0, 25.0), 727.08, 657.22, 44.5, 17.47, 'Сталь по табл. 3 ГОСТ 34655-2020'),
    ],
    '2': [  # Dn, (p_min, p_max), d_ext, d_int, h, h1, material
        (300, (6.3, 10.0), 386, 364, 18, 8.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (300, (10.0, 16.0), 402, 358, 30, 12.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (300, (16.0, 25.0), 403.23, 358.77, 28.7, 14.81, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (350, (6.3, 6.3), 431, 409, 18, 7.75, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (6.3, 10.0), 436, 404, 22, 10.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (10.0, 16.0), 442, 398, 30, 12.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (16.0, 25.0), 444.5, 393.7, 33.3, 17.3, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (400, (6.3, 6.3), 491, 469, 18, 7.75, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (6.3, 10.0), 496, 464, 22, 10.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (10.0, 16.0), 502, 458, 30, 12.0, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (16.0, 25.0), 498.48, 441.32, 36.6, 19.81, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (500, (6.3, 10.0), 596.9, 571.5, 19.1, 8.66, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (500, (10.0, 16.0), 603.25, 565.15, 25.4, 12.32, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (500, (16.0, 25.0), 619.95, 552.45, 39.6, 22.33, 'Сталь по табл. 3 ГОСТ 34655-2020'),

        (600, (6.3, 10.0), 708.03, 676.27, 22.4, 10.49, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (600, (10.0, 16.0), 717.55, 666.75, 33.3, 17.3, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (600, (16.0, 25.0), 727.08, 657.22, 44.5, 24.82, 'Сталь по табл. 3 ГОСТ 34655-2020'),
    ],
    '3': [  # Dn, (p_min, p_max), d_ext, d_int, b, R, material
        (300, (6.3, 20.0), 385, 300, 45, 472, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (350, (6.3, 20.0), 425, 350, 45, 544, 'Сталь по табл. 3 ГОСТ 34655-2020'),
        (400, (6.3, 20.0), 475, 400, 45, 620, 'Сталь по табл. 3 ГОСТ 34655-2020'),
    ]
}

GASKET_SIZES_ISO_7483 = {
    '1': [  # Dn, (p_min, p_max), d_ext, d_int, b, R, material oval
        (300, (2.0, 5.0), 388.94, 373.06, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (300, (5.0, 15.0), 392.11, 369.89, 17.46, 5.56, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (350, (2.0, 5.0), 404.82, 388.94, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (350, (5.0, 11.0), 430.21, 407.99, 17.46, 5.56, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (350, (11.0, 15.0), 434.98, 403.22, 22.23, 7.94, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (400, (2.0, 5.0), 461.97, 446.09, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (400, (5.0, 11.0), 481.01, 458.79, 17.46, 5.56, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (400, (11.0, 15.0), 485.78, 454.02, 22.23, 7.94, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (450, (2.0, 5.0), 525.47, 509.59, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (450, (5.0, 11.0), 544.51, 522.29, 17.46, 5.56, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (450, (11.0, 15.0), 552.45, 514.35, 25.4, 9.53, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (500, (2.0, 5.0), 566.74, 550.86, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (500, (5.0, 11.0), 596.9, 571.5, 19.05, 6.35, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (500, (11.0, 15.0), 603.25, 565.15, 25.4, 9.53, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (600, (2.0, 5.0), 681.04, 665.16, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (600, (5.0, 11.0), 708.03, 676.27, 22.23, 7.94, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (600, (11.0, 15.0), 717.55, 666.75, 33.34, 12.7, 'Сталь по табл. 4.6 ISO 7483-2011'),
    ],
    '2': [  # Dn, (p_min, p_max), d_ext, d_int, H, C, material octagon
        (300, (2.0, 5.0), 388.94, 373.06, 12.7, 5.23, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (300, (5.0, 15.0), 392.11, 369.89, 15.88, 7.75, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (350, (2.0, 5.0), 404.82, 388.94, 12.7, 5.23, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (350, (5.0, 11.0), 430.21, 407.99, 15.88, 7.75, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (350, (11.0, 15.0), 434.98, 403.22, 20.64, 10.49, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (400, (2.0, 5.0), 461.97, 446.09, 12.7, 5.23, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (400, (5.0, 11.0), 481.01, 458.79, 15.88, 7.75, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (400, (11.0, 15.0), 485.78, 454.02, 20.64, 10.49, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (450, (2.0, 5.0), 525.47, 509.59, 12.7, 5.23, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (450, (5.0, 11.0), 544.51, 522.29, 15.88, 7.75, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (450, (11.0, 15.0), 552.45, 514.35, 23.81, 12.32, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (500, (2.0, 5.0), 566.74, 550.86, 12.7, 5.23, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (500, (5.0, 11.0), 596.9, 571.5, 17.46, 8.66, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (500, (11.0, 15.0), 603.25, 565.15, 23.81, 12.32, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (550, (5.0, 11.0), 649.29, 620.71, 19.1, 9.6, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (600, (2.0, 5.0), 681.04, 665.16, 14.29, 3.97, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (600, (5.0, 11.0), 708.03, 676.27, 22.23, 7.94, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (600, (11.0, 15.0), 717.55, 666.75, 33.34, 12.7, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (650, (5.0, 11.0), 768.4, 730.2, 23.8, 12.3, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (650, (11.0, 15.0), 777.9, 720.7, 34.9, 19.8, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (700, (5.0, 11.0), 819.2, 781.0, 23.8, 12.3, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (700, (11.0, 16.0), 831.8, 768.4, 38.1, 22.3, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (750, (5.0, 11.0), 876.35, 838.15, 23.8, 12.3, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (750, (11.0, 15.0), 888.95, 825.55, 38.1, 22.3, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (800, (5.0, 11.0), 936.6, 892.2, 27.0, 14.8, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (800, (11.0, 15.0), 946.1, 882.7, 38.1, 22.3, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (850, (5.0, 11.0), 987.4, 943.0, 27.0, 14.8, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (850, (11.0, 15.0), 1000.1, 930.3, 41.3, 24.8, 'Сталь по табл. 4.6 ISO 7483-2011'),

        (900, (5.0, 11.0), 1044.55, 1000.15, 27.0, 14.8, 'Сталь по табл. 4.6 ISO 7483-2011'),
        (900, (11.0, 15.0), 1057.25, 987.45, 41.3, 24.8, 'Сталь по табл. 4.6 ISO 7483-2011'),
    ]
}

GASKET_SIZES_28759_8 = {
    '1': [  # Dn, (p_min, p_max), d_ext, d_int, H, C, material octagon
        (400, (6.3, 6.3), 442.0, 418.0, 16.0, 7.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (400, (6.3, 10.0), 487.0, 463.0, 16.0, 7.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (400, (10.0, 16.0), 495.0, 455.0, 25.0, 9.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (450, (6.3, 6.3), 522.0, 498.0, 16.0, 7.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (450, (6.3, 10.0), 539.0, 511.0, 18.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (450, (10.0, 16.0), 547.0, 503.0, 26.0, 10.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (500, (6.3, 6.3), 572.0, 548.0, 16.0, 7.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (500, (6.3, 10.0), 591.0, 559.0, 20.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (500, (10.0, 16.0), 599.0, 551.0, 30.0, 12.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (600, (6.3, 6.3), 699.0, 671.0, 18.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (600, (6.3, 10.0), 693.0, 657.0, 23.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (600, (10.0, 16.0), 701.0, 649.0, 32.0, 13.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (700, (6.3, 6.3), 799.0, 771.0, 18.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (700, (6.3, 10.0), 795.0, 755.0, 25.0, 9.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (700, (10.0, 16.0), 822.0, 758.0, 38.0, 16.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (800, (6.3, 6.3), 908.0, 872.0, 23.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (800, (6.3, 10.0), 897.0, 853.0, 26.0, 10.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (800, (10.0, 16.0), 946.0, 874.0, 42.0, 16.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (900, (6.3, 6.3), 1043.0, 1007.0, 23.0, 8.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (900, (6.3, 10.0), 1016.0, 964.0, 32.0, 13.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (900, (10.0, 16.0), 1055.0, 975.0, 48.0, 18.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (1000, (6.3, 6.3), 1092.0, 1048.0, 26.0, 10.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1000, (6.3, 10.0), 1118.0, 1062.0, 34.0, 14.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1000, (10.0, 16.0), 1162.0, 1078.0, 50.0, 18.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (1100, (6.3, 6.3), 1192.0, 1148.0, 26.0, 10.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1100, (6.3, 10.0), 1220.0, 1160.0, 36.0, 15.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1100, (10.0, 16.0), 1281.0, 1189.0, 54.0, 18.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),

        (1200, (6.3, 6.3), 1304.0, 1256.0, 30.0, 12.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1200, (6.3, 10.0), 1322.0, 1258.0, 38.0, 16.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
        (1200, (10.0, 16.0), 1400.0, 1300.0, 58.0, 20.0, 'Сталь по табл. 2 ГОСТ 28759.8-2022'),
    ]
}

gasket_params = {
    'material': ['Паронит по ГОСТ 481-80', 'Фторопласт-4 или лента ПН по ГОСТ 24222-80',
                 'Уплотнительный материал ФУМ-В', 'Листовая резина тип 1 по ГОСТ 7338-77',
                 'Сталь по табл. 3 ГОСТ 34655-2020', 'Сталь по табл. 4.6 ISO 7483-2011',
                 'Сталь по табл. 2 ГОСТ 28759.8-2022'],
    'm': [2.5, 2.5, 2.5, 0.5, 5.5, 6.5, 5.5],
    'q_obj': [35.0, 10.0, 10.0, 2.0, 125.0, 180.0, 125.0],
    'q_obj_dop': [130.0, 40.0, 40.0, 18.0, 0.0, 0.0, 0.0],  # Для сталей не применимо
    'K_obj': [0.9, 1.0, 1.0, 0.4, 0.0, 0.0, 0.0],
    'E_p': [0.0000002, 0.0000002, 0.0000002, None, 205000, 206000, 205000]
    # Для сталей не применимо, для резины вычисляется
}

gasket_type_map = {
                'ГОСТ 15180-86': 'ring',
                ('ISO 7483-2011', '2'): 'octagon',
                ('ГОСТ 28759.8-2022', '1'): 'octagon',
                ('ГОСТ 34655-2020', '2'): 'octagon',
                ('ГОСТ 34655-2020', '3'): 'octagon',
                ('ISO 7483-2011', '1'): 'oval',
                ('ГОСТ 34655-2020', '1'): 'oval',
            }
